pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_bootloader_syntax.h
//---------------------------------------------------------------------------*
//                                                                           *
//                     File 'pic18_bootloader_syntax.h'                      *
//             Generated by version version GALGAS_BETA_VERSION              *
//                      june 19th, 2011, at 10h48'35"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_bootloader_syntax_ENTITIES_DEFINED
#define pic18_bootloader_syntax_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "piccolo_lexique.h"

//---------------------------------------------------------------------------*

#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_bootloader_specification_semantics.h"
#include "pic18_semantics.h"
#include "ipic18_build_binary_code.h"
#include "ipic18_metamodel.h"
#include "ipic_generic.h"
#include "piccoloDevice_semantics.h"
#include "ipic18_build_assembly_code.h"
#include "piccolo_embedded_devices.h"
#include "pic18_checkingAndBuildIPIC.h"
#include "ipc18_convert_relatives.h"
#include "ipic18_optimizations.h"
#include "piccolo_config.h"
#include "ram_sections.h"

//---------------------------------------------------------------------------*

class GALGAS__32_stringlist ;
class GALGAS_FA_5F_instruction_5F_base_5F_code ;
class GALGAS_actualConfigurationMap ;
class GALGAS_andCondition ;
class GALGAS_application ;
class GALGAS_bcc_5F_in_5F_structured_5F_if_5F_condition ;
class GALGAS_binaryset ;
class GALGAS_bitNumberExpression ;
class GALGAS_bitNumberLabelValue ;
class GALGAS_bitNumberLiteralValue ;
class GALGAS_bitSliceTable ;
class GALGAS_bitTest_5F_in_5F_structured_5F_if_5F_condition ;
class GALGAS_bit_5F_oriented_5F_op ;
class GALGAS_bool ;
class GALGAS_bootloaderReservedRAMmap ;
class GALGAS_byteDeclarationInRam ;
class GALGAS_char ;
class GALGAS_commonBranchList ;
class GALGAS_commonDeclarationInRam ;
class GALGAS_condionalBranchMode ;
class GALGAS_conditionExpression ;
class GALGAS_conditional_5F_branch ;
class GALGAS_configDefinitionList ;
class GALGAS_configFieldMap ;
class GALGAS_configRegisterMap ;
class GALGAS_configRegisterMaskMap ;
class GALGAS_configSettingList ;
class GALGAS_constantDefinitionList ;
class GALGAS_constantMap ;
class GALGAS_data ;
class GALGAS_declarationInRam ;
class GALGAS_declarationInRamList ;
class GALGAS_double ;
class GALGAS_emittedCodeList ;
class GALGAS_fieldSettingMap ;
class GALGAS_filewrapper ;
class GALGAS_function ;
class GALGAS_functionlist ;
class GALGAS_if_5F_semi_5F_colon_5F_op ;
class GALGAS_illegalMaskList ;
class GALGAS_immediatAdd ;
class GALGAS_immediatAnd ;
class GALGAS_immediatComplement ;
class GALGAS_immediatDiv ;
class GALGAS_immediatEqualTest ;
class GALGAS_immediatExpression ;
class GALGAS_immediatExpressionList ;
class GALGAS_immediatGreaterOrEqualTest ;
class GALGAS_immediatGreaterTest ;
class GALGAS_immediatInteger ;
class GALGAS_immediatLeftShift ;
class GALGAS_immediatLowerOrEqualTest ;
class GALGAS_immediatLowerTest ;
class GALGAS_immediatMod ;
class GALGAS_immediatMul ;
class GALGAS_immediatNegate ;
class GALGAS_immediatNotEqualTest ;
class GALGAS_immediatOr ;
class GALGAS_immediatRegister ;
class GALGAS_immediatRightShift ;
class GALGAS_immediatSlice ;
class GALGAS_immediatSliceExpressionList ;
class GALGAS_immediatSub ;
class GALGAS_immediatXor ;
class GALGAS_incDecRegisterInCondition ;
class GALGAS_instructionList ;
class GALGAS_instruction_5F_CLRWDT ;
class GALGAS_instruction_5F_DAW ;
class GALGAS_instruction_5F_FA ;
class GALGAS_instruction_5F_FBA ;
class GALGAS_instruction_5F_FDA ;
class GALGAS_instruction_5F_FDA_5F_base_5F_code ;
class GALGAS_instruction_5F_FOREVER ;
class GALGAS_instruction_5F_IF_5F_BitTest ;
class GALGAS_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON ;
class GALGAS_instruction_5F_IF_5F_IncDec ;
class GALGAS_instruction_5F_IF_5F_SEMI_5F_COLON ;
class GALGAS_instruction_5F_JSR ;
class GALGAS_instruction_5F_JUMP ;
class GALGAS_instruction_5F_JUMPCC ;
class GALGAS_instruction_5F_LFSR ;
class GALGAS_instruction_5F_MNOP ;
class GALGAS_instruction_5F_MOVFF ;
class GALGAS_instruction_5F_NOP ;
class GALGAS_instruction_5F_POP ;
class GALGAS_instruction_5F_PUSH ;
class GALGAS_instruction_5F_RESET ;
class GALGAS_instruction_5F_SLEEP ;
class GALGAS_instruction_5F_TBLRD ;
class GALGAS_instruction_5F_TBLWT ;
class GALGAS_instruction_5F_banksel ;
class GALGAS_instruction_5F_computed_5F_bra ;
class GALGAS_instruction_5F_computed_5F_goto ;
class GALGAS_instruction_5F_computed_5F_rcall ;
class GALGAS_instruction_5F_computed_5F_retlw ;
class GALGAS_instruction_5F_do_5F_while ;
class GALGAS_instruction_5F_literalOperation ;
class GALGAS_instruction_5F_nobanksel ;
class GALGAS_instruction_5F_savebank ;
class GALGAS_instruction_5F_structured_5F_if ;
class GALGAS_interruptDefinitionList ;
class GALGAS_ipic_31__38__5F_instruction ;
class GALGAS_ipic_31__38__5F_instructionList ;
class GALGAS_ipic_31__38__5F_instruction_5F_BitTestSkip ;
class GALGAS_ipic_31__38__5F_instruction_5F_CLRWDT ;
class GALGAS_ipic_31__38__5F_instruction_5F_DAW ;
class GALGAS_ipic_31__38__5F_instruction_5F_FA ;
class GALGAS_ipic_31__38__5F_instruction_5F_FBA ;
class GALGAS_ipic_31__38__5F_instruction_5F_FDA ;
class GALGAS_ipic_31__38__5F_instruction_5F_LFSR ;
class GALGAS_ipic_31__38__5F_instruction_5F_MNOP ;
class GALGAS_ipic_31__38__5F_instruction_5F_MOVFF ;
class GALGAS_ipic_31__38__5F_instruction_5F_MOVLB ;
class GALGAS_ipic_31__38__5F_instruction_5F_NOP ;
class GALGAS_ipic_31__38__5F_instruction_5F_POP ;
class GALGAS_ipic_31__38__5F_instruction_5F_PUSH ;
class GALGAS_ipic_31__38__5F_instruction_5F_RESET ;
class GALGAS_ipic_31__38__5F_instruction_5F_RETFIE ;
class GALGAS_ipic_31__38__5F_instruction_5F_RETURN ;
class GALGAS_ipic_31__38__5F_instruction_5F_SLEEP ;
class GALGAS_ipic_31__38__5F_instruction_5F_TBLRD ;
class GALGAS_ipic_31__38__5F_instruction_5F_TBLWT ;
class GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_bra ;
class GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_goto ;
class GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_rcall ;
class GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_retlw ;
class GALGAS_ipic_31__38__5F_instruction_5F_conditionalBranch ;
class GALGAS_ipic_31__38__5F_instruction_5F_literalOperation ;
class GALGAS_ipic_31__38__5F_symbolTable ;
class GALGAS_ipic_31__38__5F_symbolTableForConvertingRelatives ;
class GALGAS_ipic_5F_JSR ;
class GALGAS_ipic_5F_JUMP ;
class GALGAS_ipic_5F_NULL ;
class GALGAS_ipic_5F_actualInstruction ;
class GALGAS_ipic_5F_incDecRegisterInCondition ;
class GALGAS_ipic_5F_jump_5F_test_5F_register ;
class GALGAS_ipic_5F_pseudo_5F_LABEL ;
class GALGAS_ipic_5F_pseudo_5F_ORG ;
class GALGAS_ipic_5F_registerComparisonCondition ;
class GALGAS_ipic_5F_registerExpression ;
class GALGAS_ipic_5F_registerExpressionWithoutBSRIndication ;
class GALGAS_jumpInstructionKind ;
class GALGAS_lbool ;
class GALGAS_lchar ;
class GALGAS_ldouble ;
class GALGAS_literal_5F_instruction_5F_opcode ;
class GALGAS_location ;
class GALGAS_lsint ;
class GALGAS_lsint_36__34_ ;
class GALGAS_lstring ;
class GALGAS_lstringlist ;
class GALGAS_luint ;
class GALGAS_luint_36__34_ ;
class GALGAS_luintlist ;
class GALGAS_negateCondition ;
class GALGAS_object ;
class GALGAS_objectlist ;
class GALGAS_partList ;
class GALGAS_piccoloDeviceModel ;
class GALGAS_piccoloModel ;
class GALGAS_piccolo_5F_instruction ;
class GALGAS_processorType ;
class GALGAS_programKind ;
class GALGAS_ramBankTable ;
class GALGAS_ramDefinitionList ;
class GALGAS_registerComparison ;
class GALGAS_registerComparisonCondition ;
class GALGAS_registerExpression ;
class GALGAS_registerTable ;
class GALGAS_registerTestCondition ;
class GALGAS_routineDeclarationList ;
class GALGAS_routineDefinitionList ;
class GALGAS_routineKind ;
class GALGAS_routineMap ;
class GALGAS_sint ;
class GALGAS_sint_36__34_ ;
class GALGAS_string ;
class GALGAS_stringlist ;
class GALGAS_stringset ;
class GALGAS_symbolTableForOptimizations ;
class GALGAS_tableAccessOption ;
class GALGAS_type ;
class GALGAS_typelist ;
class GALGAS_uint ;
class GALGAS_uint_36__34_ ;
class GALGAS_uint_36__34_list ;
class GALGAS_uintlist ;

//---------------------------------------------------------------------------*
//                                                                           *
//            Parser class 'pic18_bootloader_syntax' declaration             *
//                                                                           *
//---------------------------------------------------------------------------*

class cParser_pic_31__38__5F_bootloader_5F_syntax {
//--- Virtual destructor
  public : virtual ~ cParser_pic_31__38__5F_bootloader_5F_syntax (void) {}

//--- Non terminal declarations
  protected : virtual void nt_parse_5F_bootloader_ (GALGAS_lstring & outArgument0,
                                                    GALGAS_lstring & outArgument1,
                                                    GALGAS_routineDeclarationList & outArgument2,
                                                    GALGAS_bootloaderReservedRAMmap & outArgument3,
                                                    GALGAS_luint & outArgument4,
                                                    GALGAS_routineDeclarationList & outArgument5,
                                                    GALGAS_ramDefinitionList & outArgument6,
                                                    GALGAS_string & outArgument7,
                                                    GALGAS_piccoloDeviceModel & outArgument8,
                                                    GALGAS_uint & outArgument9,
                                                    GALGAS_ramBankTable & outArgument10,
                                                    GALGAS_registerTable & outArgument11,
                                                    C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_ram_5F_definition_ (GALGAS_ramDefinitionList & ioArgument0,
                                                  C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_ram_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_routine_5F_declaration_ (GALGAS_routineDeclarationList & ioArgument0,
                                                       C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_ (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument0,
                                                                             GALGAS_uint & outArgument1,
                                                                             GALGAS_ramBankTable & outArgument2,
                                                                             GALGAS_registerTable & outArgument3,
                                                                             GALGAS_bootloaderReservedRAMmap & outArgument4,
                                                                             GALGAS_routineDeclarationList & outArgument5,
                                                                             GALGAS_routineDeclarationList & outArgument6,
                                                                             GALGAS_luint & outArgument7,
                                                                             C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;


//--- Rule declarations
  protected : void rule_pic_31__38__5F_bootloader_5F_syntax_parse_5F_bootloader_i0_ (GALGAS_lstring & outArgument0,
                                                                                     GALGAS_lstring & outArgument1,
                                                                                     GALGAS_routineDeclarationList & outArgument2,
                                                                                     GALGAS_bootloaderReservedRAMmap & outArgument3,
                                                                                     GALGAS_luint & outArgument4,
                                                                                     GALGAS_routineDeclarationList & outArgument5,
                                                                                     GALGAS_ramDefinitionList & outArgument6,
                                                                                     GALGAS_string & outArgument7,
                                                                                     GALGAS_piccoloDeviceModel & outArgument8,
                                                                                     GALGAS_uint & outArgument9,
                                                                                     GALGAS_ramBankTable & outArgument10,
                                                                                     GALGAS_registerTable & outArgument11,
                                                                                     C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_bootloader_5F_syntax_start_5F_symbol_i1_ (C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_bootloader_5F_syntax_start_5F_symbol_i1_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument0,
                                                                                                              GALGAS_uint & outArgument1,
                                                                                                              GALGAS_ramBankTable & outArgument2,
                                                                                                              GALGAS_registerTable & outArgument3,
                                                                                                              GALGAS_bootloaderReservedRAMmap & outArgument4,
                                                                                                              GALGAS_routineDeclarationList & outArgument5,
                                                                                                              GALGAS_routineDeclarationList & outArgument6,
                                                                                                              GALGAS_luint & outArgument7,
                                                                                                              C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_bootloader_5F_syntax_routine_5F_declaration_i2_ (GALGAS_routineDeclarationList & ioArgument0,
                                                                                        C_Lexique_piccolo_5F_lexique * inLexique) ;



//--- Select methods
  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_0 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_1 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_2 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_3 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_4 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_5 (C_Lexique_piccolo_5F_lexique *) = 0 ;

  protected : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_6 (C_Lexique_piccolo_5F_lexique *) = 0 ;


} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
